# AnalyticalPowerSourceData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalPowerSourceData Class
Members See Also
---
Represents the data and parameters of analytical power source node.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public class AnalyticalPowerSourceData : AnalyticalDistributionNodePropertyData
```

Visual Basic
---
```text
Public Class AnalyticalPowerSourceData _
	Inherits AnalyticalDistributionNodePropertyData
```

Visual C++
---
```text
public ref class AnalyticalPowerSourceData : public AnalyticalDistributionNodePropertyData
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Electrical..::..AnalyticalDistributionNodePropertyData Autodesk.Revit.DB.Electrical..::..AnalyticalPowerSourceData
# See Also
AnalyticalPowerSourceData Members
Autodesk.Revit.DB.Electrical Namespace